app/controllers/application_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def authorize_request
    header = request.headers["Authorization"]
    token = header.split(" ").last if header
    begin
      payload = decode_token(token)[0]
      @current_artist = Artist.find(payload["id"])