app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    artists = Artist.all

INSERT INTO "artists" ("username", "email", "password_digest", "artist_statement", "image_url", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    artist = Artist.new(artist_signup_params)
    if artist.save

UPDATE "artists" SET "password_digest" = $1, "updated_at" = $2, "name" = $3 WHERE "artists"."id" = $4  [["password_digest", "$2a$12$TeMd4kzwI6UFgpR.BR4PfOKcgnQRrGvPPQbzgeL6dCjpaYc.kewMm"], ["updated_at", "2021-08-17 22:26:47.801145"], ["name", "Frida Kahlo"], ["id", 2]]
---
  def update
    if @artist.update(artist_params)

DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 6]]
---
  def destroy
    if @artist.destroy

SELECT "artists".* FROM "artists" WHERE "artists"."username" = $1 LIMIT $2  [["username", "Frida"], ["LIMIT", 1]]
---
  def login
    artist = Artist.find_by(username: artist_signin_params[:username])

SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def get_artist
    @artist = Artist.find(params[:id])