app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."artist_id" = $1  [["artist_id", 2]]
---
  def index
    shows = Show.where(artist_id: params[:artist_id])

INSERT INTO "shows" ("title", "description", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "art stuffs"], ["description", "art!"], ["artist_id", 3], ["created_at", "2021-08-12 01:59:34.358552"], ["updated_at", "2021-08-12 01:59:34.358552"]]
---
  def create
    new_show = Show.new(show_params)
    if new_show.save

UPDATE "shows" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "shows"."id" = $4  [["title", "art stuffs"], ["description", "art!"], ["updated_at", "2021-08-12 01:54:07.997241"], ["id", 2]]
---
  def update
    if @show.update(show_params)

DELETE FROM "shows" WHERE "shows"."id" = $1  [["id", 2]]
---
  def destroy
    @show.destroy

SELECT "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def get_show
    @show = Show.find(params[:id])