app/controllers/works_controller.rb

  def index
    works = Work.where(show_id: params[:show_id])
---
SELECT "works".* FROM "works" WHERE "works"."show_id" = $1  [["show_id", 1]]

  def create
    new_work = Work.new(work_params)
    if new_work.save
---
INSERT INTO "works" ("title", "year", "materials", "show_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "cynical afternoon"], ["year", 2017], ["materials", "collaged paper"], ["show_id", 1], ["created_at", "2021-08-12 02:26:36.946471"], ["updated_at", "2021-08-12 02:26:36.946471"]]

  def update
    if @work.update(work_params)
---
UPDATE "works" SET "year" = $1, "updated_at" = $2 WHERE "works"."id" = $3  [["year", 2015], ["updated_at", "2021-08-12 02:30:59.204303"], ["id", 2]]

  def destroy
    @work.destroy
---
DELETE FROM "works" WHERE "works"."id" = $1  [["id", 2]]

  def get_work
    @work = Work.find(params[:id])
---
SELECT "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]